<!DOCTYPE HTML>

<html>
	<head>
		<?php include "headerPage.php" ?>
	</head>
	<body>

		<!-- Wrapper -->
			<div id="wrapper">

				<!-- Main -->
					<div id="main">
						<div class="inner">
							<!-- Header -->
							<?php include "header.php";?>
							<!-- Data Page -->
							<br />
							<h3>หลักการทำงานของเว็บไซต์</h3>
							<img src="picture/basicWeb/principleWeb.png">
							<p>&nbsp;&nbsp;&nbsp;&nbsp;เครื่องลูกข่าย (Client) จะส่งคำร้องขอบริการ (Request) ไปที่เครื่องแม่ข่าย (Server) เมื่อเครื่องแม่ข่ายได้รับคำร้องขอจะทำการค้นหาบริการแล้วตอบกลับ (Response) กลับไปหาลูกข่าย เมื่อเครื่องลูกข่ายได้รับผลการตอบกลับแล้วก็จะแสดงผลออกทางหน้าเว็บเบราว์เซอร์</p>
							
							<br />
							<h3>ประเภทของเว็บไซต์</h3>
							<b>1. Static Website</b>
							<br />
							<p>
								&nbsp;&nbsp;&nbsp;&nbsp;เว็บไซต์ที่สร้างด้วยภาษา HTML ธรรมดา และบันทึกเป็นไฟล์นามสกุล .html    เนื้อหาข้อความ รูปภาพในหน้าเว็บเพจนั้นจะเป็นไปตามที่เราเขียนกำหนดไว้
								เมื่อมีผู้เรียกดูหน้าเว็บเพจนั้น  Web Server ก็จะส่งไฟล์นั้นไปให้ยังเครื่องที่ร้องขอ และแสดงผลออกทางโปรแกรมเว็บเบราเซอร์บนเครื่องของผู้ชมนั้น
								Static Website เหมาะกับเว็บไซต์ที่มีขนาดไม่ใหญ่ จำนวนหน้าเว็บเพจไม่มาก ไม่มีการเปลี่ยนแปลงข้อมูลบ่อยๆ  และไม่มีการติดต่อฐานข้อมูล
								ถ้าเราจะสร้างเว็บรูปแบบนี้ สามารถทำได้ไม่ยาก
								<br/>
								&nbsp;&nbsp;&nbsp;&nbsp;ข้อดี คือ เราสามารถกำหนดรูปแบบการตกแต่ง และเนื้อหา ของแต่ละหน้าได้ตามต้องการ  แต่ก็ควรควบคุมสไตล์ของแต่ละหน้าให้เหมือนกันด้วย อย่าให้หน้าใดโดดจนคิดว่าเป็นคนละเว็บไซต์กัน
								<br />
								&nbsp;&nbsp;&nbsp;&nbsp;ข้อเสีย คือ การแก้ไขเปลี่ยนแปลงยุ่งยาก จะต้องแก้ไขกับไฟล์หน้าเว็บเพจนั้นๆ เมื่อแก้ไขแล้ว ก็ต้อง Upload ไฟล์นั้นขึ้นไป Web Server ใหม่ทุกครั้ง  และเว็บรูปแบบนี้จะไม่สามารถใช้งานฐานข้อมูลได้
							</p>
							<b>2. Dynamic Website</b>
							<br />
							<p>
								&nbsp;&nbsp;&nbsp;&nbsp;เว็บไซต์ที่หน้าเว็บเพจสามารถเปลี่ยนแปลงข้อมูลเองได้ โดยไม่ต้องเขียนแต่ละหน้าเว็บเพจใหม่  เช่น กระดานข่าว (Webboard), ระบบสืบค้นข้อมูล
								สังเกตได้ว่า เมื่อมีผู้มาตั้งกระทู้ และตอบกระทู้ ก็จะเกิดหน้าเว็บเพจนั้นๆ ขึ้นได้เอง โดยที่เราไม่ได้เป็นคนสร้างหน้าเว็บเพจเหล่านั้นเอง
								เว็บไซต์รูปแบบนี้จะถูกสร้างด้วยภาษา Script แบบ Server Side Script เช่น PHP, ASP, ASP.Net, JSP และอื่นๆ  ไฟล์เอกสารที่ไ้ด้จะมีนามสกุล .php, .asp เป็นต้น
								และมักจะมีการติดต่อกับฐานข้อมูลเพื่อบันทึกข้อมูลลงในฐานข้อมูล หรือนำข้อมูลจากฐานข้อมูลขึ้นมาแสดงผลเป็นหน้าเว็บเพจ
								<br />
								&nbsp;&nbsp;&nbsp;&nbsp;ส่วนการทำงานของเว็บไซต์รูปแบบนี้ จะต่างจากแบบ Static Website   โดยเมื่อมีผู้ชมเรียกดูหน้าเว็บเพจ  ไฟล์หน้าเว็บเพจนั้นจะถูกแปลและ execute คำสั่งโดยตัว Interpreter ที่ฝั่ง Server ใ้ห้อยู่ในรูปแบบเอกสาร HTML ก่อน จึงส่งกลับให้ Web Server  เพื่อส่งต่อไปให้โปรแกรมเว็บเบราเซอร์ของผู้ใช้งานต่อไป
								การสร้างเว็บไซต์รูปแบบนี้ ต้องอาศัยความรู้ในการเขียนโปรแกรมมากกว่าแบบแรกมาก  นอกจากจะต้องมีความรู้พื้นฐาน HTML แล้ว ยังต้องเขียนภาษา Server Side Script เป็นอย่างน้อย 1 ภาษา ต้องรู้เรื่องการจัดการฐานข้อมูล ต้องเขียน SQL เพื่อจัดการกับข้อมูลในฐานข้อมูลได้  และถ้าอยากให้ระบบงานทำงานได้อย่างรวดเร็วไม่ต้อง Refresh หน้าจอบ่อยๆ ยังต้องรู้เรื่อง AJAX อีกด้วย
							</p>
							<!-- End Data Page -->
						</div>
					</div>
				<!-- End Main -->
				<!-- Sidebar -->
					<div id="sidebar">
						<div class="inner">
							<?php include "menu.php" ?>
						</div>
					</div>
			</div>

		<!-- Scripts -->
			<script src="assets/js/jquery.min.js"></script>
			<script src="assets/js/skel.min.js"></script>
			<script src="assets/js/util.js"></script>
			<!--[if lte IE 8]><script src="assets/js/ie/respond.min.js"></script><![endif]-->
			<script src="assets/js/main.js"></script>

	</body>
</html>